КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ПриобретениеУслугПрочихАктивов/ПриобретениеУслугПрочихАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0026ae83-2895-428e-ac15-82af36e86bb9">
  <name>ПриобретениеУслугПрочихАктивов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0e852c0d-b794-4fb0-bc2d-37d42ade6813">
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c6037da1-72ad-44b1-814d-c23c8090c78f">
    <name>ПорядокОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6bf6eb00-fa67-4111-b2e7-44c85ed7008c">
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08135ada-a7ee-4358-8806-34a8b983a99d">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f2e99bbf-e5cc-45a4-b967-9acc63bc36aa">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2fcffcfc-7af0-4d3b-8afa-e2f293ec9ea8">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c6e6ac46-b7a0-4967-b826-effcd5a64e07">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b336af42-3221-4045-9ed2-90792e3a0ddd">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="801a1349-a095-4ff0-bd06-515f409dfaf9">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e208f2dc-f225-49ff-ac9c-e9977e14f1c2">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="32babde8-e703-495a-b87a-56fd9375e208">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07deb52a-2784-4741-9cee-cec1585c88cc">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="501abcea-8dd1-4633-8765-3650f5c83613">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1ef94737-dd58-4a52-a3e7-cdd23a78f152">
    <name>БанковскийСчетОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="85fa5fed-fe52-4695-bb78-dc074111ad81">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c9771059-9dc0-49dc-aeef-99562a5f93e7">
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6b89f3ca-4cb1-4b52-b817-9a9f235ba4a3">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a7a7213-0d40-41d7-8f7c-37e91b07b39e">
    <name>ДатаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a681788b-fd81-4603-8e5f-77146f287326">
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cc2c8878-e04c-44f0-b5cb-6e6bb058c2c0">
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="40259e07-113e-478b-b469-68ad721df8d3">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ef266448-3c74-4bd3-8a71-8d5c4d2018d4">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b289cec-4407-4dbb-a89d-3df41710e3aa">
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d05c2952-fdb8-4806-91a3-941ddb03a890">
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6bfc8a55-4bbd-4d46-8eec-cc42db582d96">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1a1d69b6-8c96-4ea2-bf57-2af41bc447c9">
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="4360b5bc-ed05-4557-a458-d5fd0c7b026a">
    <name>Расходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="495d024e-9169-42f7-b904-04537095080c">
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="73457f77-3aa1-45fc-a622-cf1bb851d465">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b71545ad-4b24-4a89-be47-af6c3d4c316b">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fea2e861-7b6c-4158-9167-60575693661d">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0593e499-79a2-45f9-9773-b38e8f11b397">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9aa2a521-af44-40a6-bf5f-ea1d75d0f473">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ab8e0c21-1497-4879-b842-6d0dcf01b2f5">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d13d483c-08ec-45d8-b7a5-15fabb3aa450">
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1e1c2d1e-5586-4eb7-828c-5412f8ff2d73">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d0c9d646-6573-4e71-a5c5-026af054a3bd">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5c8ddcba-5e12-4c71-9530-0b4c75b7ece1">
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="47fb4bac-9fef-4d5e-a8b0-1241b696d15b">
      <name>СуммаНДСВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3c0a9ad6-7001-4799-b431-bb2c9120d75c">
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="14bc95a6-8efb-4d2d-8f1a-ba68d722ec76">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9e1942e0-782d-4ceb-95cb-81b63c27f19a">
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f20c8056-c8c7-4481-be99-330885064bb8">
      <name>КомментарийРаспределения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f30d13c5-85ab-4224-aee7-62cbec6e995c">
      <name>УдалитьАналитикаУчетаПартий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ПриобретениеУслугПрочихАктивов/ObjectModule.bsl
&После("ОбработкаЗаполнения")
Процедура ОД_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда

		Партнер					= ДанныеЗаполнения.ПеревозчикПартнер;
		Контрагент				= КонтрагентПартнера(Партнер);
		ЦенаВключаетНДС			= Истина;
		ЗакупкаПодДеятельность	= НалогообложениеНДС;
		
		ЗаполнитьТабличнуюЧасть_ПоЗаказуКлиента(ДанныеЗаполнения.Товары, ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда

		Д = РеквизитыДляЗаполнения();
		
		Организация				= Д.Организация;
		Партнер					= ДанныеЗаполнения.Перевозчик;
		Контрагент				= КонтрагентПартнера(Партнер);
		ЦенаВключаетНДС			= Истина;
		ЗакупкаПодДеятельность	= НалогообложениеНДС;

		ЗаполнитьТабличнуюЧасть_ПоЗаданиюНаПеревозку(ДанныеЗаполнения.Распоряжения);

	КонецЕсли;	
	
КонецПроцедуры

Функция РеквизитыДляЗаполнения()
	
	Рез = Новый Структура();
	Рез.Вставить("Организация",		Справочники.Организации.НайтиПоРеквизиту("ИНН", "7706469887"));
	Рез.Вставить("Содержание",		"Доставка товара");
	Рез.Вставить("Подразделение",	Справочники.СтруктураПредприятия.НайтиПоНаименованию("Торговый отдел", Истина));
	Рез.Вставить("СтатьяРасходов",	ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Транспортировка при продаже товара", Истина));

	Если Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления.Найти("НДС22") <> Неопределено Тогда
		Рез.Вставить("СтавкаНДС", Перечисления.СтавкиНДС.НДС22);
	Иначе
		Рез.Вставить("СтавкаНДС", Перечисления.СтавкиНДС.НДС20);
	КонецЕсли;

	Возврат Рез;

КонецФункции // ()

Функция КонтрагентПартнера(п_Партнер)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", п_Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции // ()

Процедура ЗаполнитьТабличнуюЧасть_ПоЗаказуКлиента(п_Товары, п_ДокументОснования)
	
	Д = РеквизитыДляЗаполнения();
	
	НоваяСтрока = Расходы.Добавить();
	НоваяСтрока.Содержание			= Д.Содержание;
	НоваяСтрока.Количество			= 1;
	НоваяСтрока.Подразделение		= Д.Подразделение;
	НоваяСтрока.СтатьяРасходов		= Д.СтатьяРасходов;
	НоваяСтрока.АналитикаРасходов	= п_ДокументОснования;
	НоваяСтрока.СтавкаНДС			= Д.СтавкаНДС;

КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧасть_ПоЗаданиюНаПеревозку(п_ТабличнаяЧасть)
	
	Д = РеквизитыДляЗаполнения();
	
	Для каждого Т Из п_ТабличнаяЧасть Цикл
	
		НоваяСтрока = Расходы.Добавить();
		НоваяСтрока.Содержание			= Д.Содержание;
		НоваяСтрока.Количество			= 1;
		НоваяСтрока.Подразделение		= Д.Подразделение;
		НоваяСтрока.СтатьяРасходов		= Д.СтатьяРасходов;
		НоваяСтрока.АналитикаРасходов	= Т.Распоряжение;
		НоваяСтрока.СтавкаНДС			= Д.СтавкаНДС;
	
	КонецЦикла;

КонецПроцедуры
